{
  "_name_or_path": "ELiRF/NASCA",
  "activation_dropout": 0.0,
  "activation_function": "gelu",
  "architectures": [
    "BartForConditionalGeneration"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "classifier_dropout": 0.0,
  "d_model": 1024,
  "decoder_attention_heads": 16,
  "decoder_ffn_dim": 4096,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 12,
  "decoder_start_token_id": 1,
  "dropout": 0.1,
  "early_stopping": true,
  "encoder_attention_heads": 16,
  "encoder_ffn_dim": 4096,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 12,
  "eos_token_id": 2,
  "forced_eos_token_id": 2,
  "gradient_checkpointing": false,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2"
  },
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2
  },
  "mask_sent_token_id": 6,
  "mask_token_id": 5,
  "max_length": 150,
  "max_position_embeddings": 512,
  "min_length": 25,
  "model_type": "bart",
  "no_repeat_ngram_size": 3,
  "num_beams": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "repetition_penalty": 2.0,
  "scale_embedding": false,
  "task_specific_params": {
    "summarization": {
      "early_stopping": true,
      "max_length": 150,
      "min_length": 25,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "repetition_penalty": 2.0
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.25.0",
  "unk_token_id": 3,
  "use_cache": true,
  "vocab_size": 60000
}
